Autodesk.Revit.DB.BuiltInFailures.NumberingFailures.NumberAlreadyInUseError
The new number is already in use.

Autodesk.Revit.DB.BuiltInFailures.NumberingFailures.MoreThenOneElementWasChanged
The operation lead to the renumbering of more then one element.

Autodesk.Revit.DB.BuiltInFailures.NumberingFailures.InputOutOfValidRangeError
The input value is out of the allowed range.